MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32BG26B420F3200IM48/mcu.h
/* Include standard ARM headers for the core */
// #include "core_cm33.h"        /* Core Header File */  // Note: Changed for MikroE implementation.
// #include "system_efr32bg26.h" /* System Header File */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFR32BG26B420F3200IM48_Part */

/**************************************************************************//**
 * @defgroup EFR32BG26B420F3200IM48_Peripheral_TypeDefs EFR32BG26B420F3200IM48 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
// #include "efr32bg26_emu.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_burtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_hfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_fsrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_dpll.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_lfxo.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_lfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_ulfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_keyscan.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_msc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_icache.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_prs.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_ldmaxbar.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_timer.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_mpahbram.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_syscfg.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_buram.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_eusart.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_dcdc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_mailbox.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_usart.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_sysrtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_lcd.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_lcdrf.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_aes.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_smu.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_iadc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_amuxcp.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_hfxo.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_semailbox.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_mvp.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_devinfo.h"  // Note: Changed for MikroE implementation.

/* Custom headers for LDMAXBAR and PRS mappings */
// #include "efr32bg26_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg26_ldmaxbar_defines.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFR32BG26B420F3200IM48_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup EFR32BG26B420F3200IM48_Peripheral_Base EFR32BG26B420F3200IM48 Peripheral Memory Map
 * @{
 *****************************************************************************/

#define EMU_S_BASE                (0x40004000UL) /* EMU_S base address */
#define CMU_S_BASE                (0x40008000UL) /* CMU_S base address */
#define BURTC_S_BASE              (0x4000C000UL) /* BURTC_S base address */
#define HFRCO0_S_BASE             (0x40010000UL) /* HFRCO0_S base address */
#define FSRCO_S_BASE              (0x40018000UL) /* FSRCO_S base address */
#define DPLL0_S_BASE              (0x4001C000UL) /* DPLL0_S base address */
#define LFXO_S_BASE               (0x40020000UL) /* LFXO_S base address */
#define LFRCO_S_BASE              (0x40024000UL) /* LFRCO_S base address */
#define ULFRCO_S_BASE             (0x40028000UL) /* ULFRCO_S base address */
#define KEYSCAN_S_BASE            (0x4002C000UL) /* KEYSCAN_S base address */
#define MSC_S_BASE                (0x40030000UL) /* MSC_S base address */
#define ICACHE0_S_BASE            (0x40034000UL) /* ICACHE0_S base address */
#define PRS_S_BASE                (0x40038000UL) /* PRS_S base address */
#define GPIO_S_BASE               (0x4003C000UL) /* GPIO_S base address */
#define LDMA_S_BASE               (0x40040000UL) /* LDMA_S base address */
#define LDMAXBAR_S_BASE           (0x40044000UL) /* LDMAXBAR_S base address */
#define TIMER0_S_BASE             (0x40048000UL) /* TIMER0_S base address */
#define TIMER1_S_BASE             (0x4004C000UL) /* TIMER1_S base address */
#define TIMER2_S_BASE             (0x40050000UL) /* TIMER2_S base address */
#define TIMER3_S_BASE             (0x40054000UL) /* TIMER3_S base address */
#define TIMER4_S_BASE             (0x40058000UL) /* TIMER4_S base address */
#define TIMER5_S_BASE             (0x4005C000UL) /* TIMER5_S base address */
#define TIMER6_S_BASE             (0x40060000UL) /* TIMER6_S base address */
#define TIMER7_S_BASE             (0x40064000UL) /* TIMER7_S base address */
#define TIMER8_S_BASE             (0x40068000UL) /* TIMER8_S base address */
#define TIMER9_S_BASE             (0x4006C000UL) /* TIMER9_S base address */
#define DMEM0_S_BASE              (0x40074000UL) /* DMEM0_S base address */
#define DMEM1_S_BASE              (0x40078000UL) /* DMEM1_S base address */
#define SYSCFG_S_CFGNS_BASE       (0x4007C000UL) /* SYSCFG_S_CFGNS base address */
#define SYSCFG_S_BASE             (0x40080000UL) /* SYSCFG_S base address */
#define BURAM_S_BASE              (0x40084000UL) /* BURAM_S base address */
#define GPCRC_S_BASE              (0x40088000UL) /* GPCRC_S base address */
#define EUSART1_S_BASE            (0x4008C000UL) /* EUSART1_S base address */
#define EUSART2_S_BASE            (0x40090000UL) /* EUSART2_S base address */
#define EUSART3_S_BASE            (0x40094000UL) /* EUSART3_S base address */
#define DCDC_S_BASE               (0x40098000UL) /* DCDC_S base address */
#define HOSTMAILBOX_S_BASE        (0x4009C000UL) /* HOSTMAILBOX_S base address */
#define USART0_S_BASE             (0x400A0000UL) /* USART0_S base address */
#define USART1_S_BASE             (0x400A4000UL) /* USART1_S base address */
#define USART2_S_BASE             (0x400A8000UL) /* USART2_S base address */
#define SYSRTC0_S_BASE            (0x400AC000UL) /* SYSRTC0_S base address */
#define I2C1_S_BASE               (0x400B0000UL) /* I2C1_S base address */
#define I2C2_S_BASE               (0x400B4000UL) /* I2C2_S base address */
#define I2C3_S_BASE               (0x400B8000UL) /* I2C3_S base address */
#define LCD_S_BASE                (0x400BC000UL) /* LCD_S base address */
#define LCDRF_S_BASE              (0x400C0000UL) /* LCDRF_S base address */
#define RADIOAES_S_BASE           (0x44000000UL) /* RADIOAES_S base address */
#define SMU_S_BASE                (0x44008000UL) /* SMU_S base address */
#define SMU_S_CFGNS_BASE          (0x4400C000UL) /* SMU_S_CFGNS base address */
#define LETIMER0_S_BASE           (0x49000000UL) /* LETIMER0_S base address */
#define IADC0_S_BASE              (0x49004000UL) /* IADC0_S base address */
#define ACMP0_S_BASE              (0x49008000UL) /* ACMP0_S base address */
#define ACMP1_S_BASE              (0x4900C000UL) /* ACMP1_S base address */
#define AMUXCP0_S_BASE            (0x49020000UL) /* AMUXCP0_S base address */
#define VDAC0_S_BASE              (0x49024000UL) /* VDAC0_S base address */
#define VDAC1_S_BASE              (0x49028000UL) /* VDAC1_S base address */
#define PCNT0_S_BASE              (0x49030000UL) /* PCNT0_S base address */
#define HFRCOEM23_S_BASE          (0x4A000000UL) /* HFRCOEM23_S base address */
#define HFXO0_S_BASE              (0x4A004000UL) /* HFXO0_S base address */
#define I2C0_S_BASE               (0x4B000000UL) /* I2C0_S base address */
#define WDOG0_S_BASE              (0x4B004000UL) /* WDOG0_S base address */
#define WDOG1_S_BASE              (0x4B008000UL) /* WDOG1_S base address */
#define EUSART0_S_BASE            (0x4B010000UL) /* EUSART0_S base address */
#define SEMAILBOX_S_HOST_BASE     (0x4C000000UL) /* SEMAILBOX_S_HOST base address */
#define MVP_S_BASE                (0x4D000000UL) /* MVP_S base address */
#define EMU_NS_BASE               (0x50004000UL) /* EMU_NS base address */
#define CMU_NS_BASE               (0x50008000UL) /* CMU_NS base address */
#define BURTC_NS_BASE             (0x5000C000UL) /* BURTC_NS base address */
#define HFRCO0_NS_BASE            (0x50010000UL) /* HFRCO0_NS base address */
#define FSRCO_NS_BASE             (0x50018000UL) /* FSRCO_NS base address */
#define DPLL0_NS_BASE             (0x5001C000UL) /* DPLL0_NS base address */
#define LFXO_NS_BASE              (0x50020000UL) /* LFXO_NS base address */
#define LFRCO_NS_BASE             (0x50024000UL) /* LFRCO_NS base address */
#define ULFRCO_NS_BASE            (0x50028000UL) /* ULFRCO_NS base address */
#define KEYSCAN_NS_BASE           (0x5002C000UL) /* KEYSCAN_NS base address */
#define MSC_NS_BASE               (0x50030000UL) /* MSC_NS base address */
#define ICACHE0_NS_BASE           (0x50034000UL) /* ICACHE0_NS base address */
#define PRS_NS_BASE               (0x50038000UL) /* PRS_NS base address */
#define GPIO_NS_BASE              (0x5003C000UL) /* GPIO_NS base address */
#define LDMA_NS_BASE              (0x50040000UL) /* LDMA_NS base address */
#define LDMAXBAR_NS_BASE          (0x50044000UL) /* LDMAXBAR_NS base address */
#define TIMER0_NS_BASE            (0x50048000UL) /* TIMER0_NS base address */
#define TIMER1_NS_BASE            (0x5004C000UL) /* TIMER1_NS base address */
#define TIMER2_NS_BASE            (0x50050000UL) /* TIMER2_NS base address */
#define TIMER3_NS_BASE            (0x50054000UL) /* TIMER3_NS base address */
#define TIMER4_NS_BASE            (0x50058000UL) /* TIMER4_NS base address */
#define TIMER5_NS_BASE            (0x5005C000UL) /* TIMER5_NS base address */
#define TIMER6_NS_BASE            (0x50060000UL) /* TIMER6_NS base address */
#define TIMER7_NS_BASE            (0x50064000UL) /* TIMER7_NS base address */
#define TIMER8_NS_BASE            (0x50068000UL) /* TIMER8_NS base address */
#define TIMER9_NS_BASE            (0x5006C000UL) /* TIMER9_NS base address */
#define DMEM0_NS_BASE             (0x50074000UL) /* DMEM0_NS base address */
#define DMEM1_NS_BASE             (0x50078000UL) /* DMEM1_NS base address */
#define SYSCFG_NS_CFGNS_BASE      (0x5007C000UL) /* SYSCFG_NS_CFGNS base address */
#define SYSCFG_NS_BASE            (0x50080000UL) /* SYSCFG_NS base address */
#define BURAM_NS_BASE             (0x50084000UL) /* BURAM_NS base address */
#define GPCRC_NS_BASE             (0x50088000UL) /* GPCRC_NS base address */
#define EUSART1_NS_BASE           (0x5008C000UL) /* EUSART1_NS base address */
#define EUSART2_NS_BASE           (0x50090000UL) /* EUSART2_NS base address */
#define EUSART3_NS_BASE           (0x50094000UL) /* EUSART3_NS base address */
#define DCDC_NS_BASE              (0x50098000UL) /* DCDC_NS base address */
#define HOSTMAILBOX_NS_BASE       (0x5009C000UL) /* HOSTMAILBOX_NS base address */
#define USART0_NS_BASE            (0x500A0000UL) /* USART0_NS base address */
#define USART1_NS_BASE            (0x500A4000UL) /* USART1_NS base address */
#define USART2_NS_BASE            (0x500A8000UL) /* USART2_NS base address */
#define SYSRTC0_NS_BASE           (0x500AC000UL) /* SYSRTC0_NS base address */
#define I2C1_NS_BASE              (0x500B0000UL) /* I2C1_NS base address */
#define I2C2_NS_BASE              (0x500B4000UL) /* I2C2_NS base address */
#define I2C3_NS_BASE              (0x500B8000UL) /* I2C3_NS base address */
#define LCD_NS_BASE               (0x500BC000UL) /* LCD_NS base address */
#define LCDRF_NS_BASE             (0x500C0000UL) /* LCDRF_NS base address */
#define RADIOAES_NS_BASE          (0x54000000UL) /* RADIOAES_NS base address */
#define SMU_NS_BASE               (0x54008000UL) /* SMU_NS base address */
#define SMU_NS_CFGNS_BASE         (0x5400C000UL) /* SMU_NS_CFGNS base address */
#define LETIMER0_NS_BASE          (0x59000000UL) /* LETIMER0_NS base address */
#define IADC0_NS_BASE             (0x59004000UL) /* IADC0_NS base address */
#define ACMP0_NS_BASE             (0x59008000UL) /* ACMP0_NS base address */
#define ACMP1_NS_BASE             (0x5900C000UL) /* ACMP1_NS base address */
#define AMUXCP0_NS_BASE           (0x59020000UL) /* AMUXCP0_NS base address */
#define VDAC0_NS_BASE             (0x59024000UL) /* VDAC0_NS base address */
#define VDAC1_NS_BASE             (0x59028000UL) /* VDAC1_NS base address */
#define PCNT0_NS_BASE             (0x59030000UL) /* PCNT0_NS base address */
#define HFRCOEM23_NS_BASE         (0x5A000000UL) /* HFRCOEM23_NS base address */
#define HFXO0_NS_BASE             (0x5A004000UL) /* HFXO0_NS base address */
#define I2C0_NS_BASE              (0x5B000000UL) /* I2C0_NS base address */
#define WDOG0_NS_BASE             (0x5B004000UL) /* WDOG0_NS base address */
#define WDOG1_NS_BASE             (0x5B008000UL) /* WDOG1_NS base address */
#define EUSART0_NS_BASE           (0x5B010000UL) /* EUSART0_NS base address */
#define SEMAILBOX_NS_HOST_BASE    (0x5C000000UL) /* SEMAILBOX_NS_HOST base address */
#define MVP_NS_BASE               (0x5D000000UL) /* MVP_NS base address */

#if defined(SL_COMPONENT_CATALOG_PRESENT)
// #include "sl_component_catalog.h"  // Note: Changed for MikroE implementation.

#endif
#if defined(SL_CATALOG_TRUSTZONE_SECURE_CONFIG_PRESENT)
// #include "sl_trustzone_secure_config.h"  // Note: Changed for MikroE implementation.

#endif

